In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("../data/HR_RAW_DATA.csv",index_col=0)
df

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,...,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",...,20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",...,33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",...,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,...,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,...,19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,"967,0",...,16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,45,No,non-travel,"805,0$",NaN,4,2,NaN,1,"972,0",...,9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,NaN,...,8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,36,No,non-travel,"1229,0$",NaN,8,4,Technical Degree,1,"990,0",...,7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,46,No,NaN,"566,0$",NaN,7,2,Medical,1,NaN,...,8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

pd.set_option('display.max_columns', None)pd.set_option('display.max_rows', None)

In [3]:
pd.set_option('display.max_columns', None)
#pd.set_option('display.max_rows', None)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1614 entries, 0 to 1613
Data columns (total 41 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1614 non-null   object
 1   Attrition                 1614 non-null   object
 2   BusinessTravel            842 non-null    object
 3   DailyRate                 1614 non-null   object
 4   Department                302 non-null    object
 5   DistanceFromHome          1614 non-null   int64
 6   Education                 1614 non-null   int64
 7   EducationField            869 non-null    object
 8   employeecount             1614 non-null   int64
 9   employeenumber            1183 non-null   object
 10  EnvironmentSatisfaction   1614 non-null   int64
 11  Gender                    1614 non-null   int64
 12  HourlyRate                1614 non-null   object
 13  JobInvolvement            1614 non-null   int64
 14  JobLevel                  1614 non-null   int64
 15  JobRole                   1614 non-null   object
 16  JobSatisfaction           1614 non-null   int64
 17  MaritalStatus             963 non-null    object
 18  MonthlyIncome             771 non-null    object
 19  MonthlyRate               1614 non-null   int64
 20  NUMCOMPANIESWORKED        1614 non-null   int64
 21  Over18                    713 non-null    object
 22  OverTime                  938 non-null    object
 23  PercentSalaryHike         1614 non-null   int64
 24  PerformanceRating         1419 non-null   object
 25  RelationshipSatisfaction  1614 non-null   int64
 26  StandardHours             419 non-null    object
 27  StockOptionLevel          1614 non-null   int64
 28  TOTALWORKINGYEARS         1088 non-null   object
 29  TrainingTimesLastYear     1614 non-null   int64
 30  WORKLIFEBALANCE           1506 non-null   object
 31  YearsAtCompany            1614 non-null   int64
 32  YearsInCurrentRole        34 non-null     object
 33  YearsSinceLastPromotion   1614 non-null   int64
 34  YEARSWITHCURRMANAGER      1614 non-null   int64
 35  SameAsMonthlyIncome       771 non-null    object
 36  DateBirth                 1614 non-null   int64
 37  Salary                    1614 non-null   object
 38  RoleDepartament           302 non-null    object
 39  NUMBERCHILDREN            0 non-null      float64
 40  RemoteWork                1614 non-null   object
dtypes: float64(1), int64(18), object(22)
memory usage: 529.6+ KB

In [5]:
df.head(10)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",3,0,58,3,5,ManaGER,4,Married,"19232,0",4933,1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
5,48,No,NaN,"117,0$",Research & Development,22,3,Medical,1,"1900,0",4,1,58,3,4,MANAger,4,NaN,"17174,0",2437,3,NaN,No,11,"3,0",2,NaN,1,NaN,3,"3,0",22,NaN,4,7,"17174,0",1975,1000000000$,MANAger - Research & Development,NaN,Yes
6,59,No,NaN,"1435,0$",NaN,25,3,Life Sciences,1,"81,0",1,1,99,3,3,Sales ExeCutIVe,1,NaN,NaN,2354,7,Y,NaN,11,"3,0",4,NaN,0,"28,0",3,"2,0",21,NaN,7,9,NaN,1964,1000000000$,NaN,NaN,True
7,42,No,travel_rarely,"635,0$",NaN,1,1,NaN,1,"387,0",2,0,99,3,2,Sales eXEcUTiVe,3,Married,NaN,24532,1,NaN,No,25,"4,0",3,NaN,0,"20,0",3,"3,0",20,NaN,11,6,NaN,1981,1000000000$,NaN,NaN,0
8,41,No,NaN,"1276,0$",NaN,2,5,NaN,1,NaN,2,1,91,3,4,mANAGEr,1,Married,"16595,0",5626,7,NaN,No,16,"3,0",2,NaN,1,"22,0",2,"3,0",18,NaN,11,8,"16595,0",1982,1000000000$,NaN,NaN,True
9,41,No,travel_frequently,"840,0$",NaN,9,3,NaN,1,"999,0",1,0,64,3,5,reSEaRCH DIrectoR,3,NaN,NaN,3735,2,NaN,No,17,"3,0",2,NaN,1,"21,0",2,"4,0",18,NaN,0,11,NaN,1982,1000000000$,NaN,NaN,0

In [6]:
df.describe ().T

,count,mean,std,min,25%,50%,75%,max
DistanceFromHome,1614.0,4.527261,14.591913,-49.0,2.0,5.0,11.0,29.0
Education,1614.0,2.925031,1.022357,1.0,2.0,3.0,4.0,5.0
employeecount,1614.0,1.000000,0.000000,1.0,1.0,1.0,1.0,1.0
EnvironmentSatisfaction,1614.0,4.294919,6.993559,1.0,2.0,3.0,4.0,49.0
Gender,1614.0,0.398389,0.489718,0.0,0.0,0.0,1.0,1.0
JobInvolvement,1614.0,2.739777,0.711567,1.0,2.0,3.0,3.0,4.0
JobLevel,1614.0,2.068154,1.101344,1.0,1.0,2.0,3.0,5.0
JobSatisfaction,1614.0,2.738538,1.106163,1.0,2.0,3.0,4.0,4.0
MonthlyRate,1614.0,14284.495663,7110.414585,2094.0,8001.0,14248.5,20364.0,26999.0
NUMCOMPANIESWORKED,1614.0,2.673482,2.506152,0.0,1.0,2.0,4.0,9.0
PercentSalaryHike,1614.0,15.165428,3.648610,11.0,12.0,14.0,18.0,25.0
RelationshipSatisfaction,1614.0,2.704461,1.079031,1.0,2.0,3.0,4.0,4.0
StockOptionLevel,1614.0,0.791202,0.842396,0.0,0.0,1.0,1.0,3.0
TrainingTimesLastYear,1614.0,2.809789,1.297765,0.0,2.0,3.0,3.0,6.0
YearsAtCompany,1614.0,7.132590,6.124237,0.0,3.0,5.0,9.0,40.0
YearsSinceLastPromotion,1614.0,2.245973,3.235665,0.0,0.0,1.0,3.0,15.0
YEARSWITHCURRMANAGER,1614.0,4.220570,3.562695,0.0,2.0,3.0,7.0,17.0
DateBirth,1614.0,1986.076208,9.101332,1963.0,1980.0,1987.0,1993.0,2005.0
NUMBERCHILDREN,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
df.describe (include="object").T   #

                    count unique                       top  freq
Age                  1614     54                        35    84
Attrition            1614      2                        No  1355
BusinessTravel        842      3             travel_rarely   586
DailyRate            1614    849                      nan$   124
Department            302      3   Research & Development    196
EducationField        869      6             Life Sciences   349
employeenumber       1183   1079                     482,0     2
HourlyRate           1614     72             Not Available    84
JobRole              1614   1579                  mANager      4
MaritalStatus         963      5                   Married   404
MonthlyIncome         771    668                    6347,0     4
Over18                713      1                         Y   713
OverTime              938      2                        No   682
PerformanceRating    1419      2                       3,0  1205
StandardHours         419      1                      80,0   419
TOTALWORKINGYEARS    1088     40                      10,0   144
WORKLIFEBALANCE      1506      4                       3,0   913
YearsInCurrentRole     34     10                       2,0    11
SameAsMonthlyIncome   771    668                    6347,0     4
Salary               1614      1               1000000000$  1614
RoleDepartament       302    301        MaNAgeR  -  Sales      2
RemoteWork           1614      5                         1   360

In [8]:
df.duplicated().sum()

0

In [9]:
df["Age"].value_counts() ##Hay valores no numÃ©ricos como fifty-eight. Hacer un replace de estos y cambiarlos a nÃºmeros.

35              84
34              83
31              82
29              78
36              74
32              64
38              64
30              63
33              61
40              60
27              54
37              53
28              53
42              50
45              48
41              46
26              45
39              45
43              40
46              38
44              34
50              31
25              27
24              26
47              26
49              25
55              24
54              20
51              20
53              20
48              20
52              18
56              17
21              16
22              16
23              15
58              14
20              11
59              10
19               9
18               8
60               5
57               5
thirty-two       2
fifty-eight      1
twenty-six       1
thirty-seven     1
thirty-one       1
thirty           1
fifty-two        1
fifty-five       1
thirty-six       1
forty-seven      1
twenty-four      1
Name: Age, dtype: int64

In [10]:
df['Age'] = df['Age'].replace(['fifty_five'], '55') 
df['Age'].value_counts()

35              84
34              83
31              82
29              78
36              74
32              64
38              64
30              63
33              61
40              60
27              54
37              53
28              53
42              50
45              48
41              46
26              45
39              45
43              40
46              38
44              34
50              31
25              27
24              26
47              26
49              25
55              24
54              20
51              20
53              20
48              20
52              18
56              17
21              16
22              16
23              15
58              14
20              11
59              10
19               9
18               8
60               5
57               5
thirty-two       2
fifty-eight      1
twenty-six       1
thirty-seven     1
thirty-one       1
thirty           1
fifty-two        1
fifty-five       1
thirty-six       1
forty-seven      1
twenty-four      1
Name: Age, dtype: int64

In [11]:
nuevas_columnas = {columna: columna.lower()for columna in df.columns}

df.rename (columns=nuevas_columnas, inplace= True)

df.columns

Index(['age', 'attrition', 'businesstravel', 'dailyrate', 'department',
       'distancefromhome', 'education', 'educationfield', 'employeecount',
       'employeenumber', 'environmentsatisfaction', 'gender', 'hourlyrate',
       'jobinvolvement', 'joblevel', 'jobrole', 'jobsatisfaction',
       'maritalstatus', 'monthlyincome', 'monthlyrate', 'numcompaniesworked',
       'over18', 'overtime', 'percentsalaryhike', 'performancerating',
       'relationshipsatisfaction', 'standardhours', 'stockoptionlevel',
       'totalworkingyears', 'trainingtimeslastyear', 'worklifebalance',
       'yearsatcompany', 'yearsincurrentrole', 'yearssincelastpromotion',
       'yearswithcurrmanager', 'sameasmonthlyincome', 'datebirth', 'salary',
       'roledepartament', 'numberchildren', 'remotework'],
      dtype='object')

In [12]:
# Crear un diccionario con el cambio de edades a valores numÃ©ricos
edades_cambio =  {'fifty-five': '55', 'thirty-six': '36', 'forty-seven': '47', 'twenty-four': '24', 'thirty-seven': '37', 'fifty-two': '52', 'fifty-eight': '58', 'twenty-six': '26', 'thirty-one': '31', 'thirty': '30', 'thirty-two': '32'} 


# Reemplazar las edades en la columna "Age" utilizando el diccionario
df['age'] = df['age'].replace(edades_cambio)

# Contar las ocurrencias de cada edad en la columna "Age"
conteo_edades = df['age'].value_counts()

# Imprimir el resultado
print(conteo_edades)

35    84
31    83
34    83
29    78
36    75
32    66
38    64
30    64
33    61
40    60
27    54
37    54
28    53
42    50
45    48
41    46
26    46
39    45
43    40
46    38
44    34
50    31
24    27
47    27
25    27
55    25
49    25
54    20
51    20
53    20
48    20
52    19
56    17
22    16
21    16
58    15
23    15
20    11
59    10
19     9
18     8
60     5
57     5
Name: age, dtype: int64

In [13]:
df['age']=df['age'].apply(pd.to_numeric)

In [14]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
age,1614.0,36.920694,9.102157,18.0,30.0,36.0,43.0,60.0
distancefromhome,1614.0,4.527261,14.591913,-49.0,2.0,5.0,11.0,29.0
education,1614.0,2.925031,1.022357,1.0,2.0,3.0,4.0,5.0
employeecount,1614.0,1.000000,0.000000,1.0,1.0,1.0,1.0,1.0
environmentsatisfaction,1614.0,4.294919,6.993559,1.0,2.0,3.0,4.0,49.0
gender,1614.0,0.398389,0.489718,0.0,0.0,0.0,1.0,1.0
jobinvolvement,1614.0,2.739777,0.711567,1.0,2.0,3.0,3.0,4.0
joblevel,1614.0,2.068154,1.101344,1.0,1.0,2.0,3.0,5.0
jobsatisfaction,1614.0,2.738538,1.106163,1.0,2.0,3.0,4.0,4.0
monthlyrate,1614.0,14284.495663,7110.414585,2094.0,8001.0,14248.5,20364.0,26999.0
numcompaniesworked,1614.0,2.673482,2.506152,0.0,1.0,2.0,4.0,9.0
percentsalaryhike,1614.0,15.165428,3.648610,11.0,12.0,14.0,18.0,25.0
relationshipsatisfaction,1614.0,2.704461,1.079031,1.0,2.0,3.0,4.0,4.0
stockoptionlevel,1614.0,0.791202,0.842396,0.0,0.0,1.0,1.0,3.0
trainingtimeslastyear,1614.0,2.809789,1.297765,0.0,2.0,3.0,3.0,6.0
yearsatcompany,1614.0,7.132590,6.124237,0.0,3.0,5.0,9.0,40.0
yearssincelastpromotion,1614.0,2.245973,3.235665,0.0,0.0,1.0,3.0,15.0
yearswithcurrmanager,1614.0,4.220570,3.562695,0.0,2.0,3.0,7.0,17.0
datebirth,1614.0,1986.076208,9.101332,1963.0,1980.0,1987.0,1993.0,2005.0
numberchildren,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1614 entries, 0 to 1613
Data columns (total 41 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1614 non-null   int64
 1   attrition                 1614 non-null   object
 2   businesstravel            842 non-null    object
 3   dailyrate                 1614 non-null   object
 4   department                302 non-null    object
 5   distancefromhome          1614 non-null   int64
 6   education                 1614 non-null   int64
 7   educationfield            869 non-null    object
 8   employeecount             1614 non-null   int64
 9   employeenumber            1183 non-null   object
 10  environmentsatisfaction   1614 non-null   int64
 11  gender                    1614 non-null   int64
 12  hourlyrate                1614 non-null   object
 13  jobinvolvement            1614 non-null   int64
 14  joblevel                  1614 non-null   int64
 15  jobrole                   1614 non-null   object
 16  jobsatisfaction           1614 non-null   int64
 17  maritalstatus             963 non-null    object
 18  monthlyincome             771 non-null    object
 19  monthlyrate               1614 non-null   int64
 20  numcompaniesworked        1614 non-null   int64
 21  over18                    713 non-null    object
 22  overtime                  938 non-null    object
 23  percentsalaryhike         1614 non-null   int64
 24  performancerating         1419 non-null   object
 25  relationshipsatisfaction  1614 non-null   int64
 26  standardhours             419 non-null    object
 27  stockoptionlevel          1614 non-null   int64
 28  totalworkingyears         1088 non-null   object
 29  trainingtimeslastyear     1614 non-null   int64
 30  worklifebalance           1506 non-null   object
 31  yearsatcompany            1614 non-null   int64
 32  yearsincurrentrole        34 non-null     object
 33  yearssincelastpromotion   1614 non-null   int64
 34  yearswithcurrmanager      1614 non-null   int64
 35  sameasmonthlyincome       771 non-null    object
 36  datebirth                 1614 non-null   int64
 37  salary                    1614 non-null   object
 38  roledepartament           302 non-null    object
 39  numberchildren            0 non-null      float64
 40  remotework                1614 non-null   object
dtypes: float64(1), int64(19), object(21)
memory usage: 529.6+ KB

In [16]:
df['attrition'].value_counts()

No     1355
Yes     259
Name: attrition, dtype: int64

In [17]:
df['businesstravel'].value_counts()

travel_rarely        586
travel_frequently    165
non-travel            91
Name: businesstravel, dtype: int64

In [18]:
df['businesstravel']=df['businesstravel'].str.replace("-","_")

In [19]:
df['businesstravel']=df['businesstravel'].replace(np.nan, "desconocido")

df['businesstravel']

0         desconocido
1         desconocido
2       travel_rarely
3       travel_rarely
4         desconocido
            ...
1609    travel_rarely
1610       non_travel
1611    travel_rarely
1612       non_travel
1613      desconocido
Name: businesstravel, Length: 1614, dtype: object

In [20]:
df.rename(columns={"businesstravel": "business_travel"}, inplace=True)

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1614 entries, 0 to 1613
Data columns (total 41 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1614 non-null   int64
 1   attrition                 1614 non-null   object
 2   business_travel           1614 non-null   object
 3   dailyrate                 1614 non-null   object
 4   department                302 non-null    object
 5   distancefromhome          1614 non-null   int64
 6   education                 1614 non-null   int64
 7   educationfield            869 non-null    object
 8   employeecount             1614 non-null   int64
 9   employeenumber            1183 non-null   object
 10  environmentsatisfaction   1614 non-null   int64
 11  gender                    1614 non-null   int64
 12  hourlyrate                1614 non-null   object
 13  jobinvolvement            1614 non-null   int64
 14  joblevel                  1614 non-null   int64
 15  jobrole                   1614 non-null   object
 16  jobsatisfaction           1614 non-null   int64
 17  maritalstatus             963 non-null    object
 18  monthlyincome             771 non-null    object
 19  monthlyrate               1614 non-null   int64
 20  numcompaniesworked        1614 non-null   int64
 21  over18                    713 non-null    object
 22  overtime                  938 non-null    object
 23  percentsalaryhike         1614 non-null   int64
 24  performancerating         1419 non-null   object
 25  relationshipsatisfaction  1614 non-null   int64
 26  standardhours             419 non-null    object
 27  stockoptionlevel          1614 non-null   int64
 28  totalworkingyears         1088 non-null   object
 29  trainingtimeslastyear     1614 non-null   int64
 30  worklifebalance           1506 non-null   object
 31  yearsatcompany            1614 non-null   int64
 32  yearsincurrentrole        34 non-null     object
 33  yearssincelastpromotion   1614 non-null   int64
 34  yearswithcurrmanager      1614 non-null   int64
 35  sameasmonthlyincome       771 non-null    object
 36  datebirth                 1614 non-null   int64
 37  salary                    1614 non-null   object
 38  roledepartament           302 non-null    object
 39  numberchildren            0 non-null      float64
 40  remotework                1614 non-null   object
dtypes: float64(1), int64(19), object(21)
memory usage: 529.6+ KB

In [22]:
df['dailyrate'].value_counts()

nan$      124
691,0$      7
329,0$      7
147,0$      6
530,0$      6
         ...
317,0$      1
891,0$      1
759,0$      1
483,0$      1
105,0$      1
Name: dailyrate, Length: 849, dtype: int64

In [23]:
df.rename(columns={"dailyrate": "daily_rate"}, inplace=True)
df

,age,attrition,business_travel,daily_rate,department,distancefromhome,education,educationfield,employeecount,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,over18,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
0,51,No,desconocido,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,desconocido,"699,0$",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",3,0,58,3,5,ManaGER,4,Married,"19232,0",4933,1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,desconocido,"1319,0$",NaN,3,3,Technical Degree,1,NaN,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,"967,0",3,0,51,2,3,saLEs ExeCUTiVe,4,Married,"10325,0",5518,1,Y,NaN,11,NaN,1,NaN,1,NaN,6,"3,0",16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,45,No,non_travel,"805,0$",NaN,4,2,NaN,1,"972,0",3,0,57,3,2,LAboRaTOry tECHNiCIAn,2,NaN,"4447,0",23163,1,NaN,NaN,12,"3,0",2,NaN,0,NaN,5,"2,0",9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,NaN,13,0,41,4,3,sAlES ExECUTivE,3,Single,NaN,2560,0,NaN,No,18,"3,0",4,NaN,0,"9,0",3,"3,0",8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,36,No,non_travel,"1229,0$",NaN,8,4,Technical Degree,1,"990,0",1,0,84,3,2,SaLes ExecUtIVe,4,Divorced,NaN,25952,4,NaN,No,13,NaN,4,NaN,2,"12,0",3,"3,0",7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,46,No,desconocido,"566,0$",NaN,7,2,Medical,1,NaN,4,0,75,3,3,mAnUfactURInG DiRECTOr,3,NaN,"10845,0",24208,6,Y,NaN,13,"3,0",2,NaN,1,NaN,3,"3,0",8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

In [24]:
df['daily_rate']=df['daily_rate'].str.replace ("$", "").str.replace (",", ".")
df['daily_rate']

/tmp/ipykernel_17209/1433077915.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['daily_rate']=df['daily_rate'].str.replace ("$", "").str.replace (",", ".")

0        684.0
1        699.0
2        532.0
3        359.0
4       1319.0
         ...
1609     530.0
1610     805.0
1611     903.0
1612    1229.0
1613     566.0
Name: daily_rate, Length: 1614, dtype: object

In [25]:
df['daily_rate'].isnull().sum()

0

In [26]:
df['daily_rate']=df['daily_rate'].replace ("nan", np.nan)
df['daily_rate']

0        684.0
1        699.0
2        532.0
3        359.0
4       1319.0
         ...
1609     530.0
1610     805.0
1611     903.0
1612    1229.0
1613     566.0
Name: daily_rate, Length: 1614, dtype: object

In [27]:
df['daily_rate'].isnull().sum()

124

In [28]:
df['daily_rate']=df['daily_rate'].apply(pd.to_numeric)
df['daily_rate']

0        684.0
1        699.0
2        532.0
3        359.0
4       1319.0
         ...
1609     530.0
1610     805.0
1611     903.0
1612    1229.0
1613     566.0
Name: daily_rate, Length: 1614, dtype: float64

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1614 entries, 0 to 1613
Data columns (total 41 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1614 non-null   int64
 1   attrition                 1614 non-null   object
 2   business_travel           1614 non-null   object
 3   daily_rate                1490 non-null   float64
 4   department                302 non-null    object
 5   distancefromhome          1614 non-null   int64
 6   education                 1614 non-null   int64
 7   educationfield            869 non-null    object
 8   employeecount             1614 non-null   int64
 9   employeenumber            1183 non-null   object
 10  environmentsatisfaction   1614 non-null   int64
 11  gender                    1614 non-null   int64
 12  hourlyrate                1614 non-null   object
 13  jobinvolvement            1614 non-null   int64
 14  joblevel                  1614 non-null   int64
 15  jobrole                   1614 non-null   object
 16  jobsatisfaction           1614 non-null   int64
 17  maritalstatus             963 non-null    object
 18  monthlyincome             771 non-null    object
 19  monthlyrate               1614 non-null   int64
 20  numcompaniesworked        1614 non-null   int64
 21  over18                    713 non-null    object
 22  overtime                  938 non-null    object
 23  percentsalaryhike         1614 non-null   int64
 24  performancerating         1419 non-null   object
 25  relationshipsatisfaction  1614 non-null   int64
 26  standardhours             419 non-null    object
 27  stockoptionlevel          1614 non-null   int64
 28  totalworkingyears         1088 non-null   object
 29  trainingtimeslastyear     1614 non-null   int64
 30  worklifebalance           1506 non-null   object
 31  yearsatcompany            1614 non-null   int64
 32  yearsincurrentrole        34 non-null     object
 33  yearssincelastpromotion   1614 non-null   int64
 34  yearswithcurrmanager      1614 non-null   int64
 35  sameasmonthlyincome       771 non-null    object
 36  datebirth                 1614 non-null   int64
 37  salary                    1614 non-null   object
 38  roledepartament           302 non-null    object
 39  numberchildren            0 non-null      float64
 40  remotework                1614 non-null   object
dtypes: float64(2), int64(19), object(20)
memory usage: 529.6+ KB

In [30]:
df['department'].value_counts()

 Research & Development     196
 Sales                       91
 Human Resources             15
Name: department, dtype: int64

In [31]:
df['department']=df['department'].str.lower().str.replace("research & development","research_development").str.replace("human resources", "human_resources")

df['department'].value_counts()

 research_development     196
 sales                     91
 human_resources           15
Name: department, dtype: int64

In [32]:
df['department']=df['department'].replace (np.nan, "desconocido")

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1614 entries, 0 to 1613
Data columns (total 41 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1614 non-null   int64
 1   attrition                 1614 non-null   object
 2   business_travel           1614 non-null   object
 3   daily_rate                1490 non-null   float64
 4   department                1614 non-null   object
 5   distancefromhome          1614 non-null   int64
 6   education                 1614 non-null   int64
 7   educationfield            869 non-null    object
 8   employeecount             1614 non-null   int64
 9   employeenumber            1183 non-null   object
 10  environmentsatisfaction   1614 non-null   int64
 11  gender                    1614 non-null   int64
 12  hourlyrate                1614 non-null   object
 13  jobinvolvement            1614 non-null   int64
 14  joblevel                  1614 non-null   int64
 15  jobrole                   1614 non-null   object
 16  jobsatisfaction           1614 non-null   int64
 17  maritalstatus             963 non-null    object
 18  monthlyincome             771 non-null    object
 19  monthlyrate               1614 non-null   int64
 20  numcompaniesworked        1614 non-null   int64
 21  over18                    713 non-null    object
 22  overtime                  938 non-null    object
 23  percentsalaryhike         1614 non-null   int64
 24  performancerating         1419 non-null   object
 25  relationshipsatisfaction  1614 non-null   int64
 26  standardhours             419 non-null    object
 27  stockoptionlevel          1614 non-null   int64
 28  totalworkingyears         1088 non-null   object
 29  trainingtimeslastyear     1614 non-null   int64
 30  worklifebalance           1506 non-null   object
 31  yearsatcompany            1614 non-null   int64
 32  yearsincurrentrole        34 non-null     object
 33  yearssincelastpromotion   1614 non-null   int64
 34  yearswithcurrmanager      1614 non-null   int64
 35  sameasmonthlyincome       771 non-null    object
 36  datebirth                 1614 non-null   int64
 37  salary                    1614 non-null   object
 38  roledepartament           302 non-null    object
 39  numberchildren            0 non-null      float64
 40  remotework                1614 non-null   object
dtypes: float64(2), int64(19), object(20)
memory usage: 529.6+ KB

In [34]:
df.rename (columns={"distancefromhome": "distance_from_home", 
                    "educationfield": "education_field", 
                    "employeecount": "employee_count",
                    "employeenumber": "employee_number",
                    "environmentsatisfaction": "environment_satisfaction",
                    "hourlyrate": "hourly_rate", 
                    "jobinvolvement": "job_involvement",
                    "joblevel": "job_level",
                    "jobrole": "job_role",
                    "jobsatisfaction": "job_satisfaction",
                    "maritalstatus": "marital_status",
                    "monthlyincome": "monthly_income",
                    "monthlyrate": " monthly_rate",
                    "numcompaniesworked": "num_companies_worked",
                    "over18": "over_18",
                    "percentsalaryhike": "percent_salary_hike",
                    "performancerating": "performance_rating",
                    "relationshipsatisfaction": "relationship_satisfaction",
                    "standardhours": "standard_hours",
                    "stockoptionlevel": "stock_option_level",
                    "totalworkingyears": "total_working_years",
                    "trainingtimeslastyear": "training_times_last_year",
                    "worklifebalance": "work_life_balance",
                    "yearsatcompany": "years_at_company",
                    "yearsincurrentrole": "years_in_current_role",
                    "yearssincelastpromotion": "years_since_last_promotion",
                    "yearswithcurrmanager": "years_with_curr_manager",
                    "sameasmonthlyincome": "same_as_monthly_income",
                    "datebirth": "date_birth",
                    "roledepartament": "role_departament",
                    "numberchildren": "number_children",
                    "remotework": "remote_work"}, inplace= True)